<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Politique de confidentialit&eacute; - Marhala</title>
  <style>
    * { margin: 0; padding: 0; box-sizing: border-box; }
    body {
      font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, sans-serif;
      background: #F8F6F3;
      color: #1A1A2E;
      line-height: 1.7;
      padding: 40px 20px;
    }
    .container { max-width: 720px; margin: 0 auto; }
    .back { display: inline-block; color: #2D6A4F; text-decoration: none; font-size: 14px; margin-bottom: 24px; }
    .back:hover { text-decoration: underline; }
    h1 { font-size: 28px; font-weight: 700; color: #2D6A4F; margin-bottom: 8px; }
    .date { font-size: 13px; color: #9CA3AF; margin-bottom: 32px; }
    h2 { font-size: 18px; font-weight: 600; color: #1A1A2E; margin-top: 28px; margin-bottom: 12px; }
    p, li { font-size: 15px; color: #374151; margin-bottom: 12px; }
    ul { padding-left: 20px; margin-bottom: 12px; }
    footer { margin-top: 48px; padding-top: 24px; border-top: 1px solid #E5E7EB; font-size: 12px; color: #9CA3AF; }
  </style>
</head>
<body>
  <div class="container">
    <a href="index.html" class="back">&larr; Retour</a>
    <h1>Politique de confidentialit&eacute;</h1>
    <p class="date">Derni&egrave;re mise &agrave; jour : 22 f&eacute;vrier 2026</p>

    <p>Marhala (ci-apr&egrave;s &laquo; l'Application &raquo;) est une application mobile d'apprentissage du Coran et des Hadiths. La protection de vos donn&eacute;es personnelles est une priorit&eacute; absolue. Cette politique de confidentialit&eacute; d&eacute;crit comment nous traitons vos informations.</p>

    <h2>1. Donn&eacute;es collect&eacute;es</h2>
    <p>Marhala est con&ccedil;ue selon le principe de <strong>minimisation des donn&eacute;es</strong>. Nous ne collectons aucune donn&eacute;e personnelle identifiable.</p>
    <ul>
      <li><strong>Aucun compte utilisateur</strong> n'est requis pour utiliser l'Application.</li>
      <li><strong>Aucune donn&eacute;e personnelle</strong> (nom, e-mail, num&eacute;ro de t&eacute;l&eacute;phone) n'est collect&eacute;e.</li>
      <li><strong>Aucun cookie</strong> ou traceur publicitaire n'est utilis&eacute;.</li>
    </ul>

    <h2>2. Donn&eacute;es stock&eacute;es localement</h2>
    <p>L'Application stocke les donn&eacute;es suivantes <strong>uniquement sur votre appareil</strong> :</p>
    <ul>
      <li>Vos marhalas (dossiers d'apprentissage) et leurs titres</li>
      <li>Vos notes personnelles et r&eacute;flexions</li>
      <li>Vos surlignages de texte</li>
      <li>Vos pr&eacute;f&eacute;rences (th&egrave;me, langue d'affichage)</li>
    </ul>
    <p>Ces donn&eacute;es ne sont <strong>jamais transmises</strong> &agrave; nos serveurs ni &agrave; des tiers.</p>

    <h2>3. Chiffrement</h2>
    <p>Vos donn&eacute;es sensibles (notes, r&eacute;flexions, titres de marhalas, surlignages) sont <strong>chiffr&eacute;es localement</strong> sur votre appareil &agrave; l'aide d'un algorithme de chiffrement authentifi&eacute; (XSalsa20-Poly1305). La cl&eacute; de chiffrement est stock&eacute;e de mani&egrave;re s&eacute;curis&eacute;e dans le Keychain iOS ou le Keystore Android, et n'est jamais export&eacute;e.</p>

    <h2>4. Services tiers</h2>
    <p>L'Application communique avec les API suivantes pour r&eacute;cup&eacute;rer les textes religieux :</p>
    <ul>
      <li><strong>Quran.com API</strong> &mdash; pour les versets du Coran et leurs traductions</li>
      <li><strong>HadithAPI.com</strong> &mdash; pour les hadiths et leurs traductions</li>
    </ul>
    <p>Ces services re&ccedil;oivent uniquement des requ&ecirc;tes techniques (num&eacute;ro de sourate, num&eacute;ro de hadith) et <strong>aucune donn&eacute;e personnelle</strong>.</p>

    <h2>5. Donn&eacute;es des enfants</h2>
    <p>L'Application ne collecte sciemment aucune donn&eacute;e personnelle d'enfants de moins de 13 ans, conform&eacute;ment &agrave; la loi COPPA.</p>

    <h2>6. Partage de donn&eacute;es</h2>
    <p>Nous ne vendons, ne louons ni ne partageons aucune donn&eacute;e avec des tiers. Aucune donn&eacute;e n'est utilis&eacute;e &agrave; des fins publicitaires ou de profilage.</p>

    <h2>7. Vos droits</h2>
    <p>Puisque toutes vos donn&eacute;es sont stock&eacute;es localement sur votre appareil :</p>
    <ul>
      <li>Vous pouvez <strong>supprimer</strong> vos donn&eacute;es &agrave; tout moment en d&eacute;sinstallant l'Application.</li>
      <li>Vous gardez un <strong>contr&ocirc;le total</strong> sur vos informations.</li>
    </ul>

    <h2>8. Modifications</h2>
    <p>Nous nous r&eacute;servons le droit de modifier cette politique de confidentialit&eacute;. Toute modification sera indiqu&eacute;e par la mise &agrave; jour de la date en haut de cette page.</p>

    <h2>9. Contact</h2>
    <p>Pour toute question relative &agrave; cette politique, contactez-nous &agrave; : <a href="mailto:feedback@marhala.app" style="color: #2D6A4F;">feedback@marhala.app</a></p>

    <footer>&copy; 2025-2026 Marhala. Tous droits r&eacute;serv&eacute;s.</footer>
  </div>
</body>
</html>
