<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Conditions d'utilisation - Marhala</title>
  <style>
    * { margin: 0; padding: 0; box-sizing: border-box; }
    body {
      font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, sans-serif;
      background: #F8F6F3;
      color: #1A1A2E;
      line-height: 1.7;
      padding: 40px 20px;
    }
    .container { max-width: 720px; margin: 0 auto; }
    .back { display: inline-block; color: #2D6A4F; text-decoration: none; font-size: 14px; margin-bottom: 24px; }
    .back:hover { text-decoration: underline; }
    h1 { font-size: 28px; font-weight: 700; color: #2D6A4F; margin-bottom: 8px; }
    .date { font-size: 13px; color: #9CA3AF; margin-bottom: 32px; }
    h2 { font-size: 18px; font-weight: 600; color: #1A1A2E; margin-top: 28px; margin-bottom: 12px; }
    p, li { font-size: 15px; color: #374151; margin-bottom: 12px; }
    ul { padding-left: 20px; margin-bottom: 12px; }
    footer { margin-top: 48px; padding-top: 24px; border-top: 1px solid #E5E7EB; font-size: 12px; color: #9CA3AF; }
  </style>
</head>
<body>
  <div class="container">
    <a href="index.html" class="back">&larr; Retour</a>
    <h1>Conditions d'utilisation</h1>
    <p class="date">Derni&egrave;re mise &agrave; jour : 22 f&eacute;vrier 2026</p>

    <p>Les pr&eacute;sentes conditions d'utilisation (ci-apr&egrave;s &laquo; les Conditions &raquo;) r&eacute;gissent l'utilisation de l'application mobile Marhala (ci-apr&egrave;s &laquo; l'Application &raquo;). En t&eacute;l&eacute;chargeant ou en utilisant l'Application, vous acceptez les pr&eacute;sentes Conditions.</p>

    <h2>1. Description du service</h2>
    <p>Marhala est une application gratuite d'apprentissage et de m&eacute;morisation du Coran et des Hadiths. Elle permet aux utilisateurs de :</p>
    <ul>
      <li>Parcourir les textes du Coran et des collections de Hadiths</li>
      <li>Cr&eacute;er des dossiers d'apprentissage personnalis&eacute;s (marhalas)</li>
      <li>Prendre des notes et r&eacute;diger des r&eacute;flexions personnelles</li>
      <li>Surligner des passages importants</li>
    </ul>

    <h2>2. Utilisation acceptable</h2>
    <p>Vous vous engagez &agrave; utiliser l'Application de mani&egrave;re respectueuse et conforme &agrave; son objectif &eacute;ducatif et spirituel. Il est interdit de :</p>
    <ul>
      <li>Tenter de d&eacute;compiler, d&eacute;sassembler ou r&eacute;tro-ing&eacute;nierer l'Application</li>
      <li>Utiliser l'Application &agrave; des fins ill&eacute;gales ou nuisibles</li>
      <li>Contourner les mesures de s&eacute;curit&eacute; de l'Application</li>
    </ul>

    <h2>3. Propri&eacute;t&eacute; intellectuelle</h2>
    <p>L'Application, son code source, son design et ses fonctionnalit&eacute;s sont la propri&eacute;t&eacute; de Marhala. Les textes coraniques et les hadiths sont du domaine public ou utilis&eacute;s avec les autorisations n&eacute;cessaires via les API Quran.com et HadithAPI.com.</p>
    <p>Les notes, r&eacute;flexions et contenus que vous cr&eacute;ez dans l'Application <strong>vous appartiennent enti&egrave;rement</strong>.</p>

    <h2>4. Donn&eacute;es et confidentialit&eacute;</h2>
    <p>Vos donn&eacute;es sont stock&eacute;es localement sur votre appareil et chiffr&eacute;es. Aucune donn&eacute;e personnelle n'est collect&eacute;e ni transmise. Pour plus de d&eacute;tails, consultez notre <a href="privacy.html" style="color: #2D6A4F;">Politique de confidentialit&eacute;</a>.</p>

    <h2>5. Disponibilit&eacute; du service</h2>
    <p>L'Application est fournie &laquo; en l'&eacute;tat &raquo;. Nous nous effor&ccedil;ons d'assurer son bon fonctionnement, mais nous ne pouvons garantir :</p>
    <ul>
      <li>Un fonctionnement ininterrompu ou exempt d'erreurs</li>
      <li>La disponibilit&eacute; permanente des API tierces (Quran.com, HadithAPI.com)</li>
      <li>La compatibilit&eacute; avec tous les appareils ou versions de syst&egrave;me d'exploitation</li>
    </ul>

    <h2>6. Limitation de responsabilit&eacute;</h2>
    <p>Dans les limites autoris&eacute;es par la loi applicable, Marhala ne saurait &ecirc;tre tenu responsable de tout dommage direct ou indirect r&eacute;sultant de l'utilisation ou de l'impossibilit&eacute; d'utiliser l'Application, y compris la perte de donn&eacute;es stock&eacute;es localement.</p>

    <h2>7. Gratuit&eacute;</h2>
    <p>L'Application est enti&egrave;rement gratuite. Aucun achat int&eacute;gr&eacute; ni abonnement n'est propos&eacute;.</p>

    <h2>8. Modifications</h2>
    <p>Nous nous r&eacute;servons le droit de modifier les pr&eacute;sentes Conditions &agrave; tout moment. Les modifications prendront effet d&egrave;s leur publication sur cette page. La date de derni&egrave;re mise &agrave; jour sera actualis&eacute;e en cons&eacute;quence.</p>

    <h2>9. Droit applicable</h2>
    <p>Les pr&eacute;sentes Conditions sont r&eacute;gies par le droit fran&ccedil;ais. Tout litige relatif &agrave; l'utilisation de l'Application sera soumis aux tribunaux comp&eacute;tents.</p>

    <h2>10. Contact</h2>
    <p>Pour toute question relative aux pr&eacute;sentes Conditions, contactez-nous &agrave; : <a href="mailto:feedback@marhala.app" style="color: #2D6A4F;">feedback@marhala.app</a></p>

    <footer>&copy; 2025-2026 Marhala. Tous droits r&eacute;serv&eacute;s.</footer>
  </div>
</body>
</html>
